** Database Example
#+begin_src sql :engine mysql :dbuser org :database grocer
show databases;
#+end_src

#+RESULTS:
| Database           |
|--------------------|
| grocer             |
| information_schema |

#+begin_src sql :engine mysql :dbuser org :database grocer
show tables;
#+end_src

#+RESULTS:
| Tables_in_grocer |
|------------------|
| Customers        |
| OrderItems       |
| Orders           |
| Products         |
| Vendors          |

#+name: Vendors
#+begin_src sql :engine mysql :dbuser org :database grocer
select * from Vendors limit 3 offset 2;
#+end_src

#+RESULTS: Vendors
| vend_id | vend_name       | vend_address    | vend_city  | vend_state | vend_zip | vend_country |
|---------+-----------------+-----------------+------------+------------+----------+--------------|
| DLL01   | Doll House Inc. | 555 High Street | Dollsville | CA         |    99999 | USA          |
| FNG01   | Fun and Games   | 42 Galaxy Road  | London     | NULL       |  N16 6PS | England      |
| FRB01   | Furball Inc.    | 1000 5th Avenue | New York   | NY         |    11111 | USA          |

#+RESULTS:
| vend_id | vend_name       | vend_address    | vend_city  | vend_state | vend_zip | vend_country |
|---------+-----------------+-----------------+------------+------------+----------+--------------|
| BRE02   | Bear Emporium   | 500 Park Street | Anytown    | OH         |    44333 | USA          |
| BRS01   | Bears R Us      | 123 Main Street | Bear Town  | MI         |    44444 | USA          |
| DLL01   | Doll House Inc. | 555 High Street | Dollsville | CA         |    99999 | Usa          |
| FNG01   | Fun and Games   | 42 Galaxy Road  | London     | NULL       |  N16 6PS | England      |
| FRB01   | Furball Inc.    | 1000 5th Avenue | New York   | NY         |    11111 | USA          |
| JTS01   | Jouets et ours  | 1 Rue Amusement | Paris      | NULL       |    45678 | France       |

#+begin_src sql :engine mysql :dbuser org :database grocer
select * from Products;
#+End_src

#+RESULTS:
| prod_id | vend_id | prod_name           | prod_price | prod_desc                                                             |
|---------+---------+---------------------+------------+-----------------------------------------------------------------------|
| BNBG01  | DLL01   | Fish bean bag toy   |       3.49 | Fish bean bag toy, complete with bean bag worms with which to feed it |
| BNBG02  | DLL01   | Bird bean bag toy   |       3.49 | Bird bean bag toy, eggs are not included                              |
| BNBG03  | DLL01   | Rabbit bean bag toy |       3.49 | Rabbit bean bag toy, comes with bean bag carrots                      |
| BR01    | BRS01   | 8 inch teddy bear   |       5.99 | 8 inch teddy bear, comes with cap and jacket                          |
| BR02    | BRS01   | 12 inch teddy bear  |       8.99 | 12 inch teddy bear, comes with cap and jacket                         |
| BR03    | BRS01   | 18 inch teddy bear  |      11.99 | 18 inch teddy bear, comes with cap and jacket                         |
| RGAN01  | DLL01   | Raggedy Ann         |       4.99 | 18 inch Raggedy Ann doll                                              |
| RYL01   | FNG01   | King doll           |       9.49 | 12 inch king doll with royal garments and crown                       |
| RYL02   | FNG01   | Queen doll          |       9.49 | 12 inch queen doll with royal garments and crown                      |


#+begin_src sql :engine mysql :dbuser org :database grocer
select * from Customers;
#+end_src

#+RESULTS:
|    cust_id | cust_name     | cust_address         | cust_city | cust_state | cust_zip | cust_country | cust_contact       | cust_email            |
|------------+---------------+----------------------+-----------+------------+----------+--------------+--------------------+-----------------------|
| 1000000001 | Village Toys  | 200 Maple Lane       | Detroit   | MI         |    44444 | USA          | John Smith         | sales@villagetoys.com |
| 1000000002 | Kids Place    | 333 South Lake Drive | Columbus  | OH         |    43333 | USA          | Michelle Green     | NULL                  |
| 1000000003 | Fun4All       | 1 Sunny Place        | Muncie    | IN         |    42222 | USA          | Jim Jones          | jjones@fun4all.com    |
| 1000000004 | Fun4All       | 829 Riverside Drive  | Phoenix   | AZ         |    88888 | USA          | Denise L. Stephens | dstephens@fun4all.com |
| 1000000005 | The Toy Store | 4545 53rd Street     | Chicago   | IL         |    54545 | USA          | Kim Howard         | NULL                  |

#+begin_src sql :engine mysql :dbuser org :database grocer
select * from Orders;
#+end_src

#+RESULTS:
| order_num | order_date          |    cust_id |
|-----------+---------------------+------------|
|     20005 | 2012-05-01 00:00:00 | 1000000001 |
|     20006 | 2012-01-12 00:00:00 | 1000000003 |
|     20007 | 2012-01-30 00:00:00 | 1000000004 |
|     20008 | 2012-02-03 00:00:00 | 1000000005 |
|     20009 | 2012-02-08 00:00:00 | 1000000001 |

#+begin_src sql :engine mysql :dbuser org :database grocer
select * from OrderItems;
#+end_src

#+RESULTS:
| order_num | order_item | prod_id | quantity | item_price |
|-----------+------------+---------+----------+------------|
|     20005 |          1 | BR01    |      100 |       5.49 |
|     20005 |          2 | BR03    |      100 |      10.99 |
|     20006 |          1 | BR01    |       20 |       5.99 |
|     20006 |          2 | BR02    |       10 |       8.99 |
|     20006 |          3 | BR03    |       10 |      11.99 |
|     20007 |          1 | BR03    |       50 |      11.49 |
|     20007 |          2 | BNBG01  |      100 |       2.99 |
|     20007 |          3 | BNBG02  |      100 |       2.99 |
|     20007 |          4 | BNBG03  |      100 |       2.99 |
|     20007 |          5 | RGAN01  |       50 |       4.49 |
|     20008 |          1 | RGAN01  |        5 |       4.99 |
|     20008 |          2 | BR03    |        5 |      11.99 |
|     20008 |          3 | BNBG01  |       10 |       3.49 |
|     20008 |          4 | BNBG02  |       10 |       3.49 |
|     20008 |          5 | BNBG03  |       10 |       3.49 |
|     20009 |          1 | BNBG01  |      250 |       2.49 |
|     20009 |          2 | BNBG02  |      250 |       2.49 |
|     20009 |          3 | BNBG03  |      250 |       2.49 |

** Convert to org
#+begin_src ipython :session sql :results output
import glob
import subprocess

mds = glob.glob("*.md")
mds.remove("README.md")
for md in mds:

    cmd = f"pandoc --wrap=none {md} -o {md.replace('.md', '.org')}"
    print(cmd)
    subprocess.run(cmd, shell=True)
#+end_src

#+RESULTS:
#+begin_example
pandoc --wrap=none Lesson 7. Creating Calculated Fields.md -o Lesson 7. Creating Calculated Fields.org
pandoc --wrap=none Lesson 1. Understanding SQL.md -o Lesson 1. Understanding SQL.org
pandoc --wrap=none Lesson 16. Updating and Deleting Data.md -o Lesson 16. Updating and Deleting Data.org
pandoc --wrap=none Lesson 21. Using Cursors.md -o Lesson 21. Using Cursors.org
pandoc --wrap=none Lesson 20. Managing Transaction Processing.md -o Lesson 20. Managing Transaction Processing.org
pandoc --wrap=none Lesson 6. Using Wildcard Filtering.md -o Lesson 6. Using Wildcard Filtering.org
pandoc --wrap=none Lesson 22. Understanding Advanced SQL Features.md -o Lesson 22. Understanding Advanced SQL Features.org
pandoc --wrap=none Lesson 18. Using Views.md -o Lesson 18. Using Views.org
pandoc --wrap=none Lesson 12. Joining Tables.md -o Lesson 12. Joining Tables.org
pandoc --wrap=none Lesson 5. Advanced Data Filtering.md -o Lesson 5. Advanced Data Filtering.org
pandoc --wrap=none Lesson 13. Creating Advanced Joins.md -o Lesson 13. Creating Advanced Joins.org
pandoc --wrap=none Lesson 10. Grouping Data.md -o Lesson 10. Grouping Data.org
pandoc --wrap=none Lesson 19. Working with Stored Procedures.md -o Lesson 19. Working with Stored Procedures.org
pandoc --wrap=none Lesson 8. Using Data Manipulation Functions.md -o Lesson 8. Using Data Manipulation Functions.org
pandoc --wrap=none Lesson 14. Combining Queries.md -o Lesson 14. Combining Queries.org
pandoc --wrap=none Lesson 3. Sorting Retrieved Data.md -o Lesson 3. Sorting Retrieved Data.org
pandoc --wrap=none Lesson 2 Retrieving Data.md -o Lesson 2 Retrieving Data.org
pandoc --wrap=none Lesson 4. Filtering Data.md -o Lesson 4. Filtering Data.org
pandoc --wrap=none Lesson 17. Creating and Manipulating Tables.md -o Lesson 17. Creating and Manipulating Tables.org
pandoc --wrap=none Lesson 9. Summarizing Data.md -o Lesson 9. Summarizing Data.org
pandoc --wrap=none Lesson 15. Inserting Data.md -o Lesson 15. Inserting Data.org
pandoc --wrap=none Z.Appendix 1.md -o Z.Appendix 1.org
pandoc --wrap=none Lesson 11. Working with Subqueries.md -o Lesson 11. Working with Subqueries.org
 create.txt
'Lesson 10. Grouping Data.md'
'Lesson 11. Working with Subqueries.md'
'Lesson 12. Joining Tables.md'
'Lesson 13. Creating Advanced Joins.md'
'Lesson 14. Combining Queries.md'
'Lesson 15. Inserting Data.md'
'Lesson 16. Updating and Deleting Data.md'
'Lesson 17. Creating and Manipulating Tables.md'
'Lesson 18. Using Views.md'
'Lesson 19. Working with Stored Procedures.md'
'Lesson 1. Understanding SQL.md'
'Lesson 1. Understanding SQL.org'
'Lesson 20. Managing Transaction Processing.md'
'Lesson 21. Using Cursors.md'
'Lesson 22. Understanding Advanced SQL Features.md'
'Lesson 2 Retrieving Data.md'
'Lesson 3. Sorting Retrieved Data.md'
'Lesson 4. Filtering Data.md'
'Lesson 5. Advanced Data Filtering.md'
'Lesson 6. Using Wildcard Filtering.md'
'Lesson 7. Creating Calculated Fields.md'
'Lesson 8. Using Data Manipulation Functions.md'
'Lesson 9. Summarizing Data.md'
 LICENSE
 populate.txt
 README.md
 README.pdf
'Z.Appendix 1.md'
#+end_example

#+begin_src ipython :session sql :results output
! ls
! pandoc --wrap=none 'Lesson 19. Working with Stored Procedures.md' -o '19.Working-Stored-Procedures.org'

#+end_src

#+RESULTS:
: 
: pandoc: : openBinaryFile: does not exist (No such file or directory)
